---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ConduitSizeSettings
source: html/d385e4b4-f675-9bcc-d067-5ca7d1d000d4.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettings

Conduit sizes settings

## Syntax (C#)
```csharp
public class ConduitSizeSettings : Element,
	IEnumerable<KeyValuePair<string, ConduitSizes>>
```